import React from 'react'
import "../components/ProjectCard.css";

const ProjectCard = () => {
  return (
    <div className="card">

      {/* 이미지 */}
      <div className="card-image" />

      {/* 태그 */}
      <div className="tag-container">
        <div className="tag">안드로이드</div>
        <div className="tag">기술스택</div>
      </div>

      {/* 타이틀 */}
      <h2 className="title">링큐</h2>

      {/* 설명 */}
      <p className="description">
        프로젝트 설명입니다. 프로젝트 설명입니다.
        프로젝트 설명입니다.
      </p>

      {/* 버튼 */}
      <button className="button">
        더 알아보기
        <svg
          xmlns="http://www.w3.org/2000/svg"
          viewBox="0 0 15 13"
          fill="none"
        >
          <path
            d="M8.56592 0.199707C8.77557 0.199707 8.97606 0.28539 9.12256 0.436035L14.3716 5.83545C14.445 5.90991 14.5016 5.99863 14.5405 6.09521C14.5795 6.19191 14.6001 6.29555 14.6001 6.3999C14.6001 6.50426 14.5795 6.60789 14.5405 6.70459C14.5016 6.80118 14.445 6.88989 14.3726 6.96436L9.12256 12.3638C8.97606 12.5144 8.77557 12.6001 8.56592 12.6001C8.35645 12.6 8.15665 12.5143 8.01025 12.3638C7.86394 12.2133 7.78271 12.0098 7.78271 11.7993C7.78279 11.589 7.86404 11.3863 8.01025 11.2358L11.936 7.19971H0.98291C0.773429 7.19962 0.573613 7.11393 0.427246 6.96338C0.281084 6.81297 0.199707 6.61021 0.199707 6.3999C0.199707 6.18959 0.281084 5.98684 0.427246 5.83643C0.573613 5.68588 0.773428 5.60018 0.98291 5.6001H11.936L8.01025 1.56396C7.86404 1.41355 7.78279 1.21083 7.78271 1.00049C7.78271 0.790023 7.86394 0.586525 8.01025 0.436035C8.15665 0.285547 8.35645 0.199811 8.56592 0.199707Z"
            fill="black"
            stroke="black"
            strokeWidth="0.4"
          />
        </svg>
      </button>

    </div>
  )
}

export default ProjectCard
